{
  "products": 
  [{
      "id": "1",
      "name": "Beats Solo Wireless Headphones",
      "description": "With up to 40 hours of battery life, Beats Solo Wireless is your perfect everyday headphone",
      "price": {
        "original": 199.95,
        "current": 99.98
      },
      "features": [
        "High-performance wireless noise cancelling headphones in red",
        "Active Noise Cancelling (ANC) blocks external noise",
        "Transparency helps you stay aware of your surroundings while listening",
        "Features the Apple H1 Headphone Chip and Class 1 Bluetooth for extended range and fewer dropouts",
        "Compatible with iOS and Android",
        "Hands-free controls via “Hey Siri” on iOS devices, and voice capability with the push of the b button on a variety of compatible devices ",
        "Up to 22 hours of listening time (up to 40 hours with ANC and Transparency turned off)"
      ],
      "colors": [{
          "color": "red",
          "image": "/assets/images/beats-solo-red.png"
        },
        {
          "color": "black",
          "image": "/assets/images/beats-solo-black.png"
        }
      ]
    },
    {
      "id": "2",
      "name": "Nike Aire Force 1",
      "description": "Debuting in 1982, the AF1 was the first basketball shoe to house Nike Air, revolutionizing the game while rapidly gaining traction around the world.",
      "price": {
        "original": 109.95,
        "current": 89.98
      },
      "features": [
        "Full-grain leather in the upper adds a premium look and feel.",
        "Originally designed for performance hoops, Nike Air cushioning adds lightweight, all-day comfort.",
        "The padded, low-cut collar looks sleek and feels great."
      ],
      "colors": [{
        "color": "white",
        "image": "/assets/images/nike-af1-white.png"
      }]
    },
    {
      "id": "3",
      "name": "wireless controller ps4",
      "description": "Experience the power of gaming at your fingertips. The Sony DualShock 4 Wireless Controller for PlayStation 4 enhances your gaming experience",
      "price": {
        "original": 0,
        "current": 50
      },
      "features": [
        "The PS4 Gaming Grip was tested by top gamers in the community and they loved our grip and you will love it. Try it today with free and fast shipping.",
        "Confortable, Not need bateries",
        "Use for 5 houres."
      ],
      "colors": [{
        "color": "purple",
        "image": "/assets/images/ps4-red.png"
      },
      {
        "color": "blue",
        "image": "/assets/images/ps4-black.png"
      }
    ]
    }
  ]
}
  